posts/macbook-linux/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-05-28 Fri 08:25 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>~nebhrajani/posts/macbook-linux/</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Nebhrajani A.V." />
<html class="sea-theme">
<meta http-equiv="content-type" content="text/html; charset=UTF-8">
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<link rel="stylesheet" href="../../stylesheets/hack.css" />
<link rel="stylesheet" href="../../stylesheets/css.css" />
<link rel="stylesheet" href="../../stylesheets/standard.css" />
<link rel="stylesheet" href="../../stylesheets/index.css" />
</head>
<body>
<div id="content">
<nav class="sidebar-nav">
<a class="nav-item" title="" href="https://nebhrajani-a.github.io/">home</a>
<a class="nav-item" title="" href="https://nebhrajani-a.github.io/posts/">posts</a>
<a class="nav-item" title="" href="https://nebhrajani-a.github.io/files/">files</a>
</nav>

<h1 id="title">Christmas Project: Installing Linux On A 2006 MacBook (2,1)</h1>
<div class="post-meta"> <2021-01-01 Fri> - 6 min read
</div>

<div id="outline-container-orgc755418" class="outline-2">
<h2 id="orgc755418"><span class="section-number-2">1</span> Motivation</h2>
<div class="outline-text-2" id="text-1">
<p>
It&rsquo;s generally a good idea to leave Apple products alone. The hardware
and software are tightly integrated enough that third-party software
<i>feels</i> third party. However, Apple has the irritating tendency
of dropping support within five years, leaving your otherwise good
hardware abandoned, forcing you to buy their new, latest gimmick. Not
that I mind such a business model: it&rsquo;s made them a status symbol.
This is tolerable for phones (mostly since nobody really makes a good
phone), but it&rsquo;s not ideal for a computer. Which brings me to the
object in question, an old 2006 MacBook my grandfather used to use,
dual booted with Windows XP. It slowed down to a point where it was
impossible for him to run it anymore &#x2013; although this was more because
of malware and bloat than hardware issues &#x2013; and came to rest in an
abandoned drawer.
</p>


<p>
Recently, I had the need to take a computer somewhere, and lugging a
24 inch desktop around wasn&rsquo;t an option, so I turned to this MacBook.
When I got it, it was running OS X 10.6 Snow Leopard &#x2013; and wouldn&rsquo;t
update beyond that. The dual boot XP was long gone. Snow Leopard is a
great OS, but it&rsquo;s now too old to run anything but outdated browsers
(the Web standard moves fast) and Aquamacs. Besides, it&rsquo;s irritating
to use FreeBSD&rsquo;s command line tools rather than GNU&rsquo;s <a href="https://unix.stackexchange.com/questions/352977/why-does-this-bsd-grep-result-differ-from-gnu-grep">(known issues)</a>,
and Homebrew isn&rsquo;t as nice to use as APT. I did try, and succeeded in
installing Emacs 25.2 and MacTeX. Still, the compatible GCC was too
old to support modern C++ standards &#x2013; unacceptable. The only option
remaining was to install Linux, but for reasons outlined later, it
wasn&rsquo;t an easy job. I&rsquo;m writing this guide both for future reference
(there&rsquo;s an old Mac Mini from 2006 also), and in case it might help
somebody with some old hardware.
</p>
</div>
</div>

<div id="outline-container-orgd2f1349" class="outline-2">
<h2 id="orgd2f1349"><span class="section-number-2">2</span> Scope</h2>
<div class="outline-text-2" id="text-2">
<p>
In the beginning, I thought the MacBook I had was a 4,1,
meaning that the Linux install is the standard steps, plus
some proprietary driver installs for the Broadcom WiFi
card and trackpad. Now, the internal Matshita DVD drive is
broken. Tried loading the install ISO using an external
drive and a USB, but the Apple bootloader detected none of
these. After reading up a bit on the Internet, and
rechecking the MacBook&rsquo;s specification (2,1): I came
across <a href="https://mattgadient.com/linux-dvd-images-and-how-to-for-32-bit-efi-macs-late-2006-models/">Matt Gradient&rsquo;s website</a> which explains that the EFI
bootloader for the laptop is 32-bit, but it does support a
64-bit OS. That&rsquo;s odd in itself, but what&rsquo;s weirder is the
fact that it doesn&rsquo;t actually boot from a 32-bit version
of Linux either. From <a href="https://bugs.launchpad.net/ubuntu-cdimage/+bug/1298894">an Ubuntu bug report</a>, it turns out
that this is because, by default, Ubuntu and Debian ISOs
offer a choice to the computer for which El-Torito boot
image to use, and this doesn&rsquo;t sit well with the Mac. The
same thread has a C program that zeroes out some bytes and
takes away extra boot image options, leaving only the HFS+
boot image the Mac supports. Now the last remaining issue
is that of making a bootable USB, since the internal DVD
drive is broken. Turns out, there&rsquo;s a way to do this too.
</p>
</div>
</div>

<div id="outline-container-orgdea85b6" class="outline-2">
<h2 id="orgdea85b6"><span class="section-number-2">3</span> Procedure</h2>
<div class="outline-text-2" id="text-3">
<p>
These are simplified steps that don&rsquo;t include a lot of
head-banging and kernel panic issues I faced. Be warned,
you might face this too.
</p>
</div>
<div id="outline-container-orgd9b3070" class="outline-3">
<h3 id="orgd9b3070"><span class="section-number-3">3.1</span> Modding the ISO</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Compile the C program (<a href="https://bugs.launchpad.net/ubuntu-cdimage/+bug/1298894/comments/16">comment #16 at the bug report</a>), and pass it the ISO. It&rsquo;ll
modify it. Keep the modified file safe.
</p>
</div>
</div>
<div id="outline-container-org3211846" class="outline-3">
<h3 id="org3211846"><span class="section-number-3">3.2</span> Making a Bootable USB</h3>
<div class="outline-text-3" id="text-3-2">
<p>
The first thing to understand about classical EFI is that
it sucks. The modern UEFI is a sensible standard that
supports nearly everything you throw at it, but EFI 1.0
(2005) is almost made to make it difficult to use. Sure,
I&rsquo;ve heard people take issue with UEFI, but that&rsquo;s for
another post. So, for EFI booting, &ldquo;EFI interprets the
boot image as FAT filesystem and looks up a standardized
file path for further processing. The file name depends on
the processor type. E.g. /EFI/BOOT/BOOTIA32.EFI for 32 bit
x86 and /EFI/BOOT/BOOTX64.EFI for 64 bit x86.&rdquo; However,
here&rsquo;s where it gets weird. Legacy UEFI looks for this on
a <i>separate partition</i> (type FAT32) at the lowest
block address. However, the ISO must offer a second set of
volume descriptors and file tree at a higher block
address. The FAT32 EFI partition should be in an MBR-type
table.
</p>


<p>
Now that we know what we have to do, let&rsquo;s figure out how.
Stefan&rsquo;s guide]] is spot on, and involves writing zeros to
the USB, then creating a MBR/DOS partition table. Then,
make partition 1 the EFI partition, and write BOOTIA32.EFI
to it, along with a simple GRUB2 configuration. We then
mark <b>this partition</b> as bootable, since we want the
MacBook to boot via legacy EFI that doesn&rsquo;t support
reading boot files from ISOs. In a second partition, <code>dd</code>
the modified ISO to the second partition. Pro tip: use
<code>pv</code> to check what the pipe&rsquo;s up to (<code>sudo dd
if=/path/to/iso | pv | sudo dd of=/mount/path/ bs=4M</code>). Do
not mark it as bootable, or you&rsquo;ll be in trouble.
</p>
</div>
</div>

<div id="outline-container-org7f21a2a" class="outline-3">
<h3 id="org7f21a2a"><span class="section-number-3">3.3</span> Plug In the USB, Boot, and Watch Install Fail</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Now, holding the Option key while booting the Mac should
show an option for &rsquo;EFI boot&rsquo;. Select it, and boot into
the standard install system. I used Linux Mint 19.3 XFCE.
Open GParted. Wipe the disk (you really don&rsquo;t want OS X,
do you?) and write a new partition table of type GPT. Now,
I know that we talked about using MBR to support EFI boot,
but somehow, MBR/DOS just doesn&rsquo;t work &#x2013; I think this is
because GPT has some support for legacy EFI booting using
a protective MBR partition &#x2013; but I&rsquo;m not sure. Run
through the install, and select the &ldquo;Erase entire disk&rdquo;
option and let Mint do what it wants to.
</p>

<p>
The install fails at installing GRUB2. Don&rsquo;t worry, this
is because grub-config couldn&rsquo;t automatically figure out
where the disks are, so we&rsquo;ll tell it from the GRUB2
shell. Hold the power key till the machine boots down,
plug out the USB, and reboot. After some time, you should
see:
</p>

<div class="org-src-container">
<pre class="src src-sh">grub&gt;
</pre>
</div>

<p>
Point it to the root, load the kernel, point it to the
INITRD.IMG, and boot.
</p>

<div class="org-src-container">
<pre class="src src-sh">grub&gt; set root =<span style="color: #5EC4FF;">(</span>hd0,gpt2<span style="color: #5EC4FF;">)</span> <span style="color: #a52a2a; font-style: italic;">#</span><span style="color: #a52a2a; font-style: italic;">this was where / was located. Might vary depending on install, search around using TAB to find it</span>
grub&gt; linux /vmlinux <span style="color: #718CA1;">root</span>=/dev/sda2
grub&gt; initrd /initrd.img
grub&gt; boot
</pre>
</div>

<p>
It then boots correctly. Login, then
</p>

<pre class="example">
$ sudo update-grub
</pre>
<p>
Which is a neat script that configures GRUB according to
the current boot and /etc/default/grub.
</p>
</div>
</div>

<div id="outline-container-org6188346" class="outline-3">
<h3 id="org6188346"><span class="section-number-3">3.4</span> Welcome to Linux.</h3>
<div class="outline-text-3" id="text-3-4">
<p>
That completes the install. It&rsquo;s a bit tricky getting
everything to work the first time, so don&rsquo;t give up. You can
now configure Linux, install WiFi drivers (mine worked
OOTB), and generally play around.
</p>
</div>
</div>
</div>

<div id="outline-container-orgf6579f1" class="outline-2">
<h2 id="orgf6579f1"><span class="section-number-2">4</span> Conclusion</h2>
<div class="outline-text-2" id="text-4">
<p>
The old MacBook&rsquo;s hardware still works well. XFCE is exceptionally
light, so I tried Compiz with its cube animations, and it works
smoothly. The trackpad is slightly jittery near buttons, leading me to
believe it&rsquo;s some XFCE issue, but it&rsquo;s not enough to bother. What&rsquo;s
cool is that this old hardware is able to run a modern Linux system
with ease. The nVidia graphics card works too: I played SuperTuxKart
and Neverball without any significant issues. Emacs runs well (that&rsquo;s
pretty much all I need on a machine anyway), the daemon swallows the
&rsquo;standard&rsquo; 150 MiB of RAM in the background. \(\mathrm{\TeX}\) and GCC
work as expected. It&rsquo;s pretty much a less powerful clone of my i7
desktop. I&rsquo;m probably the only person who&rsquo;ll use such an old machine
for active development work, so I&rsquo;ll keep this page updated with
unexpected issues if I run into any.
</p>

<p>
There are a couple of annoyances: the Bluetooth doesn&rsquo;t work
sometimes, and didn&rsquo;t work well with the audio devices I tried. That
was also the case with OS X though, and I&rsquo;m not energetic enough to
try and fix that. The machine has 4 GB of RAM, but the processor
only supports 3 GB (insane, I know), but 3 GB is surprisingly
enough. If Mint XFCE gets too heavy, I may shift to something like
antiX or Bodhi, but that seems far away.
</p>


<p>
Anyway, it&rsquo;s always a fun challenge bringing old hardware
back to life: especially one with a 32-bit legacy EFI and
broken DVD drive. Merry Christmas.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<hr><p style="font-size: 75%">Created in GNU <a href="https://www.gnu.org/software/emacs/">Emacs</a> 25.2.2 (<a href="https://orgmode.org">Org</a> mode 9.3.6).</p>
</div>
</body>
</html>
